roofRackCybertruck/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    tarmac
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1920;
        startFace       121808;
    }
    upperArea
    {
        type            patch;
        nFaces          1920;
        startFace       123728;
    }
    inlet
    {
        type            patch;
        nFaces          352;
        startFace       125648;
    }
    outlet
    {
        type            patch;
        nFaces          352;
        startFace       126000;
    }
    lateralArea
    {
        type            patch;
        nFaces          2640;
        startFace       126352;
    }
    symmetryPlane
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          2640;
        startFace       128992;
    }
)

// ************************************************************************* //
