roofRackCybertruck/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    "(outlet|upperArea|lateralArea)"
    {
        //type            freestreamPressure;
        type                     zeroGradient;
        //freestreamValue          uniform 0;
    }

    "(tarmac|bodyRoofRack_mm|FR_mm|RR_mm)"
    {
        type            zeroGradient;
    }

    symmetryPlane
    {
        type            symmetry;
    }
}

// ************************************************************************* //
