roofRackCybertruck/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.375;
    }
    "(outlet|upperArea|lateralArea)"
    {
        type            zeroGradient;
    }
    "(tarmac|bodyRoofRack_mm|FR_mm|RR_mm)"
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }

    symmetryPlane
    {
        type            symmetry;
    }
}


// ************************************************************************* //
