roofRackCybertruck/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    "(outlet|upperArea|lateralArea)"
    {
        type            calculated;
        value           uniform 0;
    }

    "(tarmac|bodyRoofRack_mm|FR_mm|RR_mm)"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    symmetryPlane
    {
        type            symmetry;
    }
}


// ************************************************************************* //
