roofRackCybertruck/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    
    "(outlet|upperArea|lateralArea)"
    {
        type            zeroGradient;
    }

    "(tarmac|bodyRoofRack_mm|FR_mm|RR_mm)"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    symmetryPlane
    {
        type            symmetry;
    }
}


// ************************************************************************* //
